"""
1.if判断语句基本语法
在Python中，if语句就是用来进行判断的，格式如下：
if 要判断的条件:
    条件成立时，要做的事情

**** 注意：代码的缩进为一个tab键，或者4个空格 ——建议使用空格
在Python中，tab键和空格不要混用。

**** 注意：if语句以及缩进部分是一个完整的代码块

3.else 的语法格式：
if 要判断的条件:
    条件成立时，要做的事情
else:
    条件不成立时，要做的事情
**** 注意：if和else语句以及各自的缩进部分共同是一个完整的代码块

"""

# 1.判断年龄演练：
# 定义一个整数变量记录年龄
age = 15
# 判断是否满18岁
if age >= 18:
    # 如果满18岁，允许进网吧
    print("允许进入网吧！")

    print("if语句和缩进部分是一个完整的代码块")

print("看看什么时候会执行")


"""
2.比较运算符
==、!=、>、<、>=、<=、
"""

# 1.判断年龄演练——改进版：
# 定义一个整数变量记录年龄
age = 15
# 判断是否满18岁
if age >= 18:
    # 如果满18岁，允许进网吧
    print("允许进入网吧！")

else:
    # 未满18岁
    print("未满18周岁")

    print("if语句和缩进部分是一个完整的代码块")

print("看看什么时候会执行")


"""
4.if的嵌套
"""
