
"""
***********变量的格式化输出***********
% 被称为格式化操作符
包含 % 的字符串，被称为格式化字符串
%s : 字符串
%d : 有符号十进制整数，%06d表示输出的整数显示位数，不足6位使用0补全，超过6位原样输出
%f : 浮点数，%.02f 表示小数点后只显示两位
%% : 输出%

语法如下：
print("格式化字符" %变量1)
print("格式化字符" %(变量1,变量2,....))

"""

# 格式化输出演练
# 1.定义字符串变量 name，输出我的名字叫小明，请多多关照！
name = "小大明"
# print("我的名字叫"+ %name +"，请多多关照！")
print("我的名字叫 %s，请多多关照！" % name)

# 2.定义整数变量 student_no ，输出我的学号是 00001
# student_no = 8
student_no = 1002518
print("我的学号是 %06d" % student_no)


# 3.定义小数 price、weight、money，输出苹果单价 9.00元/斤，购买了5.00斤，需要支付 45.00元
price = 9.00
weight = 5.00
money = price * weight
print("苹果单价 %.02f元/斤，购买了%.03f斤，需要支付 %.04f元" % (price, weight, money))

# 4.定义一个小数 scale，输出数据比例是10.00%
scale = 0.1
# print("数据比例是 %%" % scale)
print("数据比例是 %.2f%%" % (scale * 100))
