"""
1、类属性术语：
    1. 创建出来的对象叫做类的实例
    2. 创建对象的动作叫做实例化
    3. 对象的属性叫做实例属性
    4. 对象调用的方法叫做实例方法

    每个对象都有自己独立的内存空间，保存各自不同的属性
    多个对象的方法，在内存中只有一份，在调用方法时，需要把对象的引用传递到方法内部
2、概念和使用
   1.类属性就是给类对象中定义的属性
   2.通常用来记录与这个类相关的特征
   3.类属性不会用于记录具体对象的特征

"""


class Tool:
    # 使用赋值语句，定义类属性，记录创建工具对象的总数
     count = 0

     def __init__(self, name):
         self.name = name

         Tool.count += 1
tool1 = Tool("斧头")
tool2 = Tool("锤子")

print(Tool.count)    # 类名.类属性

# 类属性 050 属性查找机制

"""
3、 属性的获取机制——向上查找（科普）
4、 访问类属性有两种方式：
   1.类名.类属性
   2.对象.类属性（不推荐）
    注意：【如果使用 对象.类属性=值 赋值语句，只会给对象添加一个属性，而不会影响到类属性的值】
"""
print("工具对象总数 %d" % tool1.count)   # 对象.类属性
# 使用 对象.类属性=值 赋值语句，只会给对象添加一个属性
tool2.count = 99
print("工具对象总数 %d" % tool2.count)
print("类属性的值 =====> %d " % Tool.count)




